import React from 'react';

export default function CountrySearchHeader() {
  return (
    <div className="container">
      <div className="row">
        <div className="col">
          <h2 style={{ textAlign: 'center' }}>Основные функции</h2>
          <h4 style={{ textAlign: 'left' }}>1. Просмотр списка стран</h4>
          <h5 style={{ textAlign: 'left' }}>На главной странице приложения вы увидите список стран. Вы можете просматривать их основные характеристики, такие как столица, население, площадь и ВВП.</h5>
          <h4 style={{ textAlign: 'left' }}>2. Поиск информации о стране</h4>
          <h5 style={{ textAlign: 'left' }}>Используйте поиск для быстрого нахождения нужной страны. Просто нажмите кнопку "View", и вы получите информацию о ней.</h5>
          <h4 style={{ textAlign: 'left' }}>3. Добавление города</h4>
          <h5 style={{ textAlign: 'left' }}>Если вы хотите добавить информацию о новом городе, перейдите на страницу страны и нажмите кнопку "Add City". Заполните форму с необходимыми данными о городе, и он будет добавлен к выбранной стране.</h5>
          <h4 style={{ textAlign: 'left' }}>4. Редактирование информации</h4>
          <h5 style={{ textAlign: 'left' }}>Вы можете редактировать информацию о стране, городах и нациях. Просто перейдите на соответствующую страницу и нажмите кнопку "Edit", чтобы изменить данные.</h5>
          <h4 style={{ textAlign: 'left' }}>5. Удаление записей</h4>
          <h5 style={{ textAlign: 'left' }}>Если вам нужно удалить информацию о стране, городе или нации, выберите соответствующую запись и нажмите кнопку "Delete". Подтвердите свое действие, и запись будет удалена из базы данных.</h5>
        </div>
      </div>
    </div>
  );
}
